cfd/template/acRoom-vane25/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2512                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //
//
//  9F 스마트팜 공간 — 반타원 평면 (2026-08-31, rev2 : O-그리드)
//
//  실측:  평평한 벽(현) 8.0 m  /  깊이 5.7 m  /  천장고 2.7 m
//         평면 = 반타원 (반장축 a=4.0 = 평평한 벽 방향, 반단축 b=5.7 = 깊이)
//
//  좌표계:  x = 평평한 벽을 따라  (-4.0 ~ +4.0)
//           y = 평평한 벽에서 안쪽으로  (0 = 평평한 벽, 5.7 = 곡면 꼭대기)
//           z = 높이  (0 = 바닥, 2.7 = 천장)
//
//  바닥면적 pi*a*b/2 = 35.81 m2      체적 96.70 m3
//
//  ── rev1(3블록) 폐기 이유 ─────────────────────────────────────────────
//  rev1 은 정점(0,5.7) 을 블록 꼭짓점으로 삼아 상단 블록이 뾰족하게 모였다.
//  → 비직교성 max 80.9deg, 심한 비직교면 1026개
//  → 첫 PIMPLE 반복 안에서 에너지식이 발산, 온도·속도 연쇄 폭주로 계산 실패.
//  rev2 는 O-그리드(butterfly) 로 바꿔 정점을 "호의 중간점"으로 보낸다.
//  뾰족한 모서리가 사라지고, 판넬이 균일 격자 블록 안에 통째로 들어간다.
//
//  ── rev2 블록 구성 (4블록 + arc 에지) ────────────────────────────────
//
//     y=5.7                 (정점 = 호의 중간, 꼭짓점 아님)
//                     ___----------____
//              7 ___--                 --___ 6        P1/P2 (t=48.5deg)
//     y=2.9      4 ────────[ 내부 ]──────── 5
//                 │  [좌]              [우] │
//     y=0    0 ─── 1 ──────────────────── 2 ─── 3     평평한 벽
//          -4.0  -1.8                    1.8   4.0
//
//     내부 블록  x ±1.8, y 0~2.9 → 100 mm 균일 격자.
//     에어컨 판넬(x ±0.475, y 1.525~2.475)이 여기 통째로 들어가므로
//     취출구 4개가 대칭으로 잡힌다.
//
//  셀:  내부 36x29 + 우 22x29 + 좌 22x29 + 상 36x22, 모두 x27 = 84,024 (평균 105 mm)
//
//  ※ 원본 튜토리얼(4 x 3 x 1.6 직육면체)은 blockMeshDict.tutorial-backup
//
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

scale   1;

vertices
(
    // ---- 바닥 (z = 0) ----
    (-4.0000  0.0000  0.0)      //  0  평평한 벽 왼쪽 끝
    (-1.8000  0.0000  0.0)      //  1  내부 블록 왼쪽 아래
    ( 1.8000  0.0000  0.0)      //  2  내부 블록 오른쪽 아래
    ( 4.0000  0.0000  0.0)      //  3  평평한 벽 오른쪽 끝
    (-1.8000  2.9000  0.0)      //  4  내부 블록 왼쪽 위
    ( 1.8000  2.9000  0.0)      //  5  내부 블록 오른쪽 위
    ( 2.6501  4.2696  0.0)      //  6  곡면 위 P1 (t=48.508deg)
    (-2.6501  4.2696  0.0)      //  7  곡면 위 P2

    // ---- 천장 (z = 2.7) ----
    (-4.0000  0.0000  2.7)      //  8
    (-1.8000  0.0000  2.7)      //  9
    ( 1.8000  0.0000  2.7)      // 10
    ( 4.0000  0.0000  2.7)      // 11
    (-1.8000  2.9000  2.7)      // 12
    ( 1.8000  2.9000  2.7)      // 13
    ( 2.6501  4.2696  2.7)      // 14
    (-2.6501  4.2696  2.7)      // 15
);

blocks
(
    // 내부 블록 (판넬이 여기 들어감) : 1-2-5-4
    hex ( 1  2  5  4   9 10 13 12) (36 29 27) simpleGrading (1 1 1)

    // 우측 블록 : 2-3-6-5
    hex ( 2  3  6  5  10 11 14 13) (22 29 27) simpleGrading (1 1 1)

    // 좌측 블록 : 0-1-4-7
    hex ( 0  1  4  7   8  9 12 15) (22 29 27) simpleGrading (1 1 1)

    // 상단 블록 : 4-5-6-7   (정점은 6->7 호의 중간)
    hex ( 4  5  6  7  12 13 14 15) (36 22 27) simpleGrading (1 1 1)
);

edges
(
    // ---- 바닥 반타원 호 ----
    arc  3  6 ( 3.6469  2.3415  0.0)      // t = 24.254 deg
    arc  6  7 ( 0.0000  5.7000  0.0)      // t = 90 deg  (= 곡면 정점)
    arc  7  0 (-3.6469  2.3415  0.0)      // t = 155.746 deg

    // ---- 천장 반타원 호 (동일) ----
    arc 11 14 ( 3.6469  2.3415  2.7)
    arc 14 15 ( 0.0000  5.7000  2.7)
    arc 15  8 (-3.6469  2.3415  2.7)
);

// 모든 경계면을 일단 walls 로. 취출구·흡입구는 topoSet + createPatch 로 잘라낸다.
defaultPatch
{
    name    walls;
    type    wall;
}

boundary
(
);

// ************************************************************************* //
