cfd/template/acRoom-vane25/system/topoSetDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2512                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      topoSetDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //
//
//  천장(z = 2.7)에서 에어컨 판넬 개구부를 잘라낸다.
//
//  기기 : LG 4Way 천장 카세트, 판넬 950 x 950 mm, 천장 매입(flush)
//  위치 : 평평한 벽에서 안쪽 2.0 m, 좌우 중앙   → 판넬 중심 (x, y) = (0.0, 2.0)
//
//         판넬 범위        x -0.475 ~ 0.475 ,  y 1.525 ~ 2.475
//         토출 슬롯 4개    각 650 x 46 mm  (합 0.12 m2)  ← 판넬 네 변
//         중앙 흡입 그릴   570 x 570 mm                   ← 판넬 중앙
//
//  슬롯 폭이 46 mm 라 기본 격자(100 mm)로는 한 줄밖에 안 잡힌다.
//  박스는 물리 치수대로 두고(폭 방향만 약간 여유), 해상도는 refineMesh 로 올린다.
//  → 유량은 0.orig/U 의 flowRateInletVelocity 가 실제 패치 면적으로 자동 보정하므로
//    잡히는 면 수가 달라져도 총 25 CMM 은 항상 정확하다.
//
//  ※ 원본(측벽 취출구 1개)은 topoSetDict.tutorial-backup 에 보존
//
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

actions
(
    // ---------------- 토출 슬롯 : +x 쪽 (오른쪽 변) ----------------
    {
        name    inletXp;
        type    faceSet;
        action  new;
        source  boxToFace;
        box     (0.397 1.675 2.699) (0.457 2.325 2.701);
    }

    // ---------------- 토출 슬롯 : -x 쪽 (왼쪽 변) ----------------
    {
        name    inletXm;
        type    faceSet;
        action  new;
        source  boxToFace;
        box     (-0.457 1.675 2.699) (-0.397 2.325 2.701);
    }

    // ---------------- 토출 슬롯 : +y 쪽 (곡면 벽 쪽 변) ----------------
    {
        name    inletYp;
        type    faceSet;
        action  new;
        source  boxToFace;
        box     (-0.325 2.397 2.699) (0.325 2.457 2.701);
    }

    // ---------------- 토출 슬롯 : -y 쪽 (평평한 벽 쪽 변) ----------------
    {
        name    inletYm;
        type    faceSet;
        action  new;
        source  boxToFace;
        box     (-0.325 1.543 2.699) (0.325 1.603 2.701);
    }

    // ---------------- 중앙 흡입 그릴 ----------------
    {
        name    return;
        type    faceSet;
        action  new;
        source  boxToFace;
        box     (-0.285 1.715 2.699) (0.285 2.285 2.701);
    }
);

// ************************************************************************* //
